{"backend": "tensorflow", "keras_version": "2.2.3", "config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "batch_input_shape": [null, 256], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "units": 300, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_5", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_6", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_7", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_7", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_8", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_8", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_9", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_9", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_10", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_10", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_11", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_11", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_12", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 300, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_12", "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_12", "rate": 0.28, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_13", "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "units": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}