{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "batch_input_shape": [null, 256], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_1", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_2", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_3", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_4", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_5", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_5", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_6", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_6", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_7", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_7", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_8", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_8", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_9", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_9", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_10", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_10", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_11", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_11", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_11", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "name": "dense_12", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "scale": true, "name": "batch_normalization_12", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_12", "seed": null, "rate": 0.28, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "name": "dense_13", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 32}}]}