{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 256], "name": "dense_1", "dtype": "float32", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_4"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_5"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_6", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_6"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_7", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_7"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_8", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_8"}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_9", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_9"}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_10", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_10"}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_11", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_11"}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "bias_regularizer": null, "name": "dense_12", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_12"}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.28, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "bias_regularizer": null, "name": "dense_13", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null}}], "backend": "tensorflow"}