{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 256], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "units": 300, "dtype": "float32", "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_4", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_5", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_5", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_6", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_6", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_7", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_7", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_8", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_8", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_9", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_9", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_10", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_10", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_11", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_11", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_11", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_12", "bias_regularizer": null, "trainable": true, "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_12", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.28, "name": "dropout_12", "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_13", "bias_regularizer": null, "trainable": true, "units": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null}}]}