{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 256], "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_5", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_6", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_6", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_7", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_7", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_8", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_8", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_9", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_9", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_10", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_10", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_11", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_11", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_11", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_12", "units": 300, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_12", "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_12", "rate": 0.28, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_13", "units": 37, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true}}]}